#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.herokux_registry_image.backstage will be read during apply
  # (config refers to values not yet known)
 <= data "herokux_registry_image" "backstage" {
      + app_id           = (known after apply)
      + digest           = (known after apply)
      + docker_tag       = "latest"
      + id               = (known after apply)
      + number_of_layers = (known after apply)
      + process_type     = "web"
      + schema_version   = (known after apply)
      + size             = (known after apply)
    }

  # heroku_addon.backstage_pgsql will be created
  + resource "heroku_addon" "backstage_pgsql" {
      + app_id            = (known after apply)
      + config_var_values = (sensitive value)
      + config_vars       = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + plan              = "heroku-postgresql:hobby-dev"
      + provider_id       = (known after apply)
    }

  # heroku_app.backstage will be created
  + resource "heroku_app" "backstage" {
      + acm                   = (known after apply)
      + all_config_vars       = (sensitive value)
      + buildpacks            = (known after apply)
      + config_vars           = (known after apply)
      + git_url               = (known after apply)
      + heroku_hostname       = (known after apply)
      + id                    = (known after apply)
      + internal_routing      = (known after apply)
      + name                  = (sensitive)
      + region                = (sensitive)
      + sensitive_config_vars = (sensitive value)
      + stack                 = "container"
      + uuid                  = (known after apply)
      + web_url               = (known after apply)
    }

  # heroku_app_config_association.backstage will be created
  + resource "heroku_app_config_association" "backstage" {
      + app_id         = (known after apply)
      + id             = (known after apply)
      + sensitive_vars = (sensitive value)
      + vars           = {
          + "GITHUB_AUTH_CLIENT_ID"   = ""
          + "GRAFANA_PROMETHEUS_URI"  = ""
          + "GRAFANA_PROMETHEUS_USER" = ""
          + "GRAFANA_URI"             = ""
          + "PGSSLMODE"               = "no-verify"
        }
    }

  # heroku_config.backstage_config will be created
  + resource "heroku_config" "backstage_config" {
      + id             = (known after apply)
      + sensitive_vars = (sensitive value)
      + vars           = {
          + "GITHUB_AUTH_CLIENT_ID"   = ""
          + "GRAFANA_PROMETHEUS_URI"  = ""
          + "GRAFANA_PROMETHEUS_USER" = ""
          + "GRAFANA_URI"             = ""
          + "PGSSLMODE"               = "no-verify"
        }
    }

  # herokux_app_container_release.backstage will be created
  + resource "herokux_app_container_release" "backstage" {
      + app_id       = (known after apply)
      + id           = (known after apply)
      + image_id     = (known after apply)
      + process_type = "web"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @proffalken, Action: `pull_request`*